{
    "actions": [
      "Emmek Frewn sends thugs to vandalize the tavern in the middle of the night.",
      "Emmek Frewn spreads rumors that Trollskull Manor is haunted, scaring off customers.",
      "Emmek Frewn bribes city officials to increase taxes or complicate licenses for the tavern.",
      "Emmek Frewn opens a temporary alehouse offering cheaper drinks to lure away customers.",
      "Emmek Frewn sends spies disguised as patrons to steal recipes or secrets from the tavern.",
      "Emmek Frewn sabotages the food supply by paying suppliers to delay or ruin shipments.",
      "Emmek Frewn spreads false rumors of a health violation to get the tavern shut down temporarily.",
      "Emmek Frewn hires actors to stage a violent fight inside the tavern, making it look unsafe.",
      "Emmek Frewn buys up local advertising space to flood the area with his own tavern's promotion.",
      "Emmek Frewn bribes a rival gang to start a brawl inside the tavern at peak hours.",
      "Emmek Frewn hires illusionists to create disturbing sights in the tavern that scare customers.",
      "Emmek Frewn hires a spy to tamper with the tavern's financial records, causing tax problems.",
      "Emmek Frewn spreads a rumor that one of the tavern's drinks is poisoned, driving away customers.",
      "Emmek Frewn sabotages a delivery of high-quality alcohol, causing patrons to complain about the drinks.",
      "Emmek Frewn offers free drinks at his own tavern across the street to lure customers away.",
      "Emmek Frewn hires a wizard to cast illusions of rats and other vermin inside the tavern.",
      "Emmek Frewn anonymously donates broken, low-quality furniture to tarnish the tavern’s reputation.",
      "Emmek Frewn engineers a mysterious fire that forces the tavern to close for repairs.",
      "Emmek Frewn plants evidence of illegal activities in the tavern to attract unwanted attention.",
      "Emmek Frewn hires a thief to steal valuables from patrons to create a reputation for theft.",
      "Emmek Frewn hires a bard to spread songs and stories that paint the tavern in a negative light.",
      "Emmek Frewn hires a group of thugs to set fire to the tavern's kitchen, causing chaos.",
      "Emmek Frewn offer bribes to the city guard to harass the tavern's patrons and staff.",
      "Emmek Frewn buys up all the local food suppliers to drive up prices for the tavern."

    ]
  }
  
