{
    "events": [
      "A group of bards arrives and offers to play a free concert in exchange for room and board.",
      "A noble patron starts a bar fight after accusing another guest of stealing a family heirloom.",
      "A ghost of one of the former owners makes an appearance, causing patrons to panic.",
      "An inspector from the city arrives for a surprise health inspection.",
      "A mysterious figure leaves behind a strange locked box on one of the tables.",
      "A group of adventurers offers to buy everyone a round of drinks, increasing the tavern's reputation.",
      "An apprentice wizard accidentally sets off a magical prank, causing minor chaos in the tavern.",
      "A city official visits to collect overdue taxes that were missed from the tavern's paperwork.",
      "One of the kegs has gone bad, and you must deal with an unhappy crowd of patrons.",
      "An influential merchant offers to invest in the tavern for a share of the profits.",
      "A famous adventurer arrives at the tavern, and many patrons come to meet them.",
      "A local gang demands protection money in exchange for 'keeping the tavern safe'.",
      "A magical portal briefly opens in the cellar, and something steps through.",
      "A local noble throws a lavish party in the tavern, bringing in wealthy patrons.",
      "A traveling circus performer offers a strange and captivating show to the patrons.",
      "A merchant caravan arrives, bringing exotic goods and attracting many new customers.",
      "A thief tries to pickpocket one of the guests, causing a disturbance.",
      "A bard's spell goes awry, causing all patrons to start dancing uncontrollably.",
      "A shipment of expensive, rare wine arrives unexpectedly. The label has no sender's name.",
      "A strange fog surrounds the tavern, causing patrons to feel uneasy.",
      "A renowned chef offers to cook a special dinner for a significant discount.",
      "A mysterious illness spreads among the tavern's patrons, leading to a temporary closure.",
      "A famous play troupe performs an impromptu show in the tavern, drawing in a large crowd.",
      "An old rival of the tavern's owner arrives and challenges them to a duel of skills.",
      "A hidden room is discovered in the tavern's cellar, revealing old secrets."
    ]
  }
  